# -*- coding: utf-8 -*-

from enum import Enum

class CommonRegex(Enum):
    Email = '^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$'

    Domain = '[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(/.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+/.?'

    InternetURL = '[a-zA-z]+://[^\s]* 或 ^http://([\w-]+\.)+[\w-]+(/[\w-./?%&=]*)?$'

    Phone = '^(13[0-9]|14[5|7]|15[0|1|2|3|5|6|7|8|9]|18[0|1|2|3|5|6|7|8|9])\d{8}$'

    Telephone = '^($$\d{3,4}-)|\d{3.4}-)?\d{7,8}$'

    ChinaTelephone = '\d{3}-\d{8}|\d{4}-\d{7}'   # (0511-4405222、021-87888822)

    IDNumber = '^\d{15}|\d{18}$'

    ShortIDNumber = '^([0-9]){7,18}(x|X)?$' # 或 '^\d{8,18}|[0-9x]{8,18}|[0-9X]{8,18}?$'

    帐号 = '^[a-zA-Z][a-zA-Z0-9_]{4,15}$' # 字母开头，允许5-16字节，允许字母数字下划线

    Password = '^[a-zA-Z]\w{5,17}$'

    StrongPassword = '^(?=.*\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$'

    date = '^\d{4}-\d{1,2}-\d{1,2}'

    month = '^(0?[1-9]|1[0-2])$'

    day = '^((0?[1-9])|((1|2)[0-9])|30|31)$'


    integer = '^(0|-?[1-9][0-9]*)$'
    real = '^(0|-?[1-9][0-9]*)(.[0-9]+)?$'


    readable = '^[0-9]{1,3}(,[0-9]{3})*(.[0-9]{1,2})?$'

    xmlFile = '^([a-zA-Z]+-?)+[a-zA-Z0-9]+\\.[x|X][m|M][l|L]$'

    Character = '[\u4e00-\u9fa5]'

    DoubleByte = '[^\x00-\xff]'

    whitespace = '\n\s*\r'

    HTMLTag = '<(\S*?)[^>]*>.*?</\1>|<.*? />'

    w_w = '^\s*|\s*$或(^\s*)|(\s*$)' # (可以用来删除行首行尾的空白字符(包括空格、制表符、换页符等等)，非常有用的表达式)

    QQnumber = '[1-9][0-9]{4,}' # 腾讯QQ号从10000开始

    ChinaZIP = '[1-9]\d{5}(?!\d)' # 中国邮政编码为6位数字

    IPAddress1 = '\d+\.\d+\.\d+\.\d+' # 提取IP地址时有用

    IPAddress2 = '((?:(?:25[0-5]|2[0-4]\\d|[01]?\\d?\\d)\\.){3}(?:25[0-5]|2[0-4]\\d|[01]?\\d?\\d))'
